# Pandas - PANel DAta

Types of data:
1. Cross Sectional data - multiple object at one moment of time. Example: survey
2. Time Series data - 1 object in time. Stock prices
3. Panel Data - multiple objects in multiple time moments. Census, weekly surveys, etc.

In [1]:
import pandas as pd

In [2]:
pd.Index

pandas.core.indexes.base.Index

In [3]:
print(pd.Index.__doc__)

    Immutable ndarray implementing an ordered, sliceable set. The basic object
    storing axis labels for all pandas objects.

    Parameters
    ----------
    data : array-like (1-dimensional)
    dtype : NumPy dtype (default: object)
        If dtype is None, we find the dtype that best fits the data.
        If an actual dtype is provided, we coerce to that dtype if it's safe.
        Otherwise, an error will be raised.
    copy : bool
        Make a copy of input ndarray.
    name : object
        Name to be stored in the index.
    tupleize_cols : bool (default: True)
        When True, attempt to create a MultiIndex if possible.

    See Also
    --------
    RangeIndex : Index implementing a monotonic integer range.
    CategoricalIndex : Index of :class:`Categorical` s.
    MultiIndex : A multi-level, or hierarchical Index.
    IntervalIndex : An Index of :class:`Interval` s.
    DatetimeIndex : Index of datetime64 data.
    TimedeltaIndex : Index of timedelta64 data.
    PeriodIndex : Index of Period data.
    Int64Index : A special case of :class:`Index` with purely integer labels.
    UInt64Index : A special case of :class:`Index` with purely unsigned integer labels.
    Float64Index : A special case of :class:`Index` with purely float labels.

    Notes
    -----
    An Index instance can **only** contain hashable objects

    Examples
    --------
    >>> pd.Index([1, 2, 3])
    Int64Index([1, 2, 3], dtype='int64')

    >>> pd.Index(list('abc'))
    Index(['a', 'b', 'c'], dtype='object')

In [4]:
pd.Series

pandas.core.series.Series

In [5]:
print(pd.Series.__doc__)

    One-dimensional ndarray with axis labels (including time series).

    Labels need not be unique but must be a hashable type. The object
    supports both integer- and label-based indexing and provides a host of
    methods for performing operations involving the index. Statistical
    methods from ndarray have been overridden to automatically exclude
    missing data (currently represented as NaN).

    Operations between Series (+, -, /, *, **) align values based on their
    associated index values-- they need not be the same length. The result
    index will be the sorted union of the two indexes.

    Parameters
    ----------
    data : array-like, Iterable, dict, or scalar value
        Contains data stored in Series.

        .. versionchanged:: 0.23.0
           If data is a dict, argument order is maintained for Python 3.6
           and later.

    index : array-like or Index (1d)
        Values must be hashable and have the same length as `data`.
        Non-unique index values are allowed. Will default to
        RangeIndex (0, 1, 2, ..., n) if not provided. If both a dict and index
        sequence are used, the index will override the keys found in the
        dict.
    dtype : str, numpy.dtype, or ExtensionDtype, optional
        Data type for the output Series. If not specified, this will be
        inferred from `data`.
        See the :ref:`user guide <basics.dtypes>` for more usages.
    name : str, optional
        The name to give to the Series.
    copy : bool, default False
        Copy input data.

In [6]:
l=list(range(-5,50,5))
l

[-5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [7]:
pd.Series(l)

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [8]:
pd.Series(range(-5,50,5))

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [10]:
s=pd.Series(range(-5,50,5), name='x5 numbers')

In [11]:
s

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
Name: x5 numbers, dtype: int64

In [12]:
pd.Series(11)

0    11
dtype: int64

In [14]:
pd.Series({'apple':1, 'pear':2, 'banana':3, 'orange':4})

apple     1
pear      2
banana    3
orange    4
dtype: int64

In [15]:
pd.Series({'apple':[1,2,3], 'pear':[2,3,4], 'banana':[3,4,5], 'orange':[4,5,6]})

apple     [1, 2, 3]
pear      [2, 3, 4]
banana    [3, 4, 5]
orange    [4, 5, 6]
dtype: object

In [16]:
s=pd.Series({"apple":10, 'cucumbers':3, 'bread':2, 'bacon':5,\
             'water':5, 'sunscreen':1, 'blanket':1, 'beer':10}, name='picnic')

In [17]:
s

apple        10
cucumbers     3
bread         2
bacon         5
water         5
sunscreen     1
blanket       1
beer         10
Name: picnic, dtype: int64

## Series

In [18]:
s.dtype # type of data in a Serie

dtype('int64')

In [19]:
s.values

array([10,  3,  2,  5,  5,  1,  1, 10], dtype=int64)

In [20]:
s.size #number of elements

8

In [21]:
s.name

'picnic'

In [22]:
s.empty

False

## few functions

In [24]:
#first 5 rows
s.head(5)
# limit 5 [MYSQL]

apple        10
cucumbers     3
bread         2
bacon         5
water         5
Name: picnic, dtype: int64

In [25]:
#last 5 rows
s.tail(5)

bacon         5
water         5
sunscreen     1
blanket       1
beer         10
Name: picnic, dtype: int64

In [30]:
#select 2 random rows
s.sample(2)

bacon      5
blanket    1
Name: picnic, dtype: int64

In [31]:
s

apple        10
cucumbers     3
bread         2
bacon         5
water         5
sunscreen     1
blanket       1
beer         10
Name: picnic, dtype: int64

In [32]:
#select water
s['water']

5

In [33]:
#select several rows
s[['water','apple']]

water     5
apple    10
Name: picnic, dtype: int64

In [34]:
#select everything from bread until blanket
s.loc['bread':'blanket']

bread        2
bacon        5
water        5
sunscreen    1
blanket      1
Name: picnic, dtype: int64

In [37]:
s.loc['water':'cucumbers']

Series([], Name: picnic, dtype: int64)

In [36]:
s

apple        10
cucumbers     3
bread         2
bacon         5
water         5
sunscreen     1
blanket       1
beer         10
Name: picnic, dtype: int64

In [41]:
#get the values by the row number
display(s.iloc[1])

display(s.iloc[[1,5]])

display(s.iloc[1:5])

cucumbers    3
bread        2
bacon        5
water        5
Name: picnic, dtype: int64

# DataFrame

In [43]:
print(pd.DataFrame.__doc__)

    Two-dimensional, size-mutable, potentially heterogeneous tabular data.

    Data structure also contains labeled axes (rows and columns).
    Arithmetic operations align on both row and column labels. Can be
    thought of as a dict-like container for Series objects. The primary
    pandas data structure.

    Parameters
    ----------
    data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame
        Dict can contain Series, arrays, constants, or list-like objects.

        .. versionchanged:: 0.23.0
           If data is a dict, column order follows insertion-order for
           Python 3.6 and later.

        .. versionchanged:: 0.25.0
           If data is a list of dicts, column order follows insertion-order
           for Python 3.6 and later.

    index : Index or array-like
        Index to use for resulting frame. Will default to RangeIndex if
        no indexing information part of input data and no index provided.
    columns : Index or array-like
        Column labels to use for resulting frame. Will default to
        RangeIndex (0, 1, 2, ..., n) if no column labels are provided.
    dtype : dtype, default None
        Data type to force. Only a single dtype is allowed. If None, infer.
    copy : bool, default False
        Copy data from inputs. Only affects DataFrame / 2d ndarray input.

    See Also
    --------
    DataFrame.from_records : Constructor from tuples, also record arrays.
    DataFrame.from_dict : From dicts of Series, arrays, or dicts.
    read_csv : Read a comma-separated values (csv) file into DataFrame.
    read_table : Read general delimited file into DataFrame.
    read_clipboard : Read text from clipboard into DataFrame.

    Examples
    --------
    Constructing DataFrame from a dictionary.

    >>> d = {'col1': [1, 2], 'col2': [3, 4]}
    >>> df = pd.DataFrame(data=d)
    >>> df
       col1  col2
    0     1     3
    1     2     4

    Notice that the inferred dtype is int64.

    >>> df.dtypes
    col1    int64
    col2    int64
    dtype: object

    To enforce a single dtype:

    >>> df = pd.DataFrame(data=d, dtype=np.int8)
    >>> df.dtypes
    col1    int8
    col2    int8
    dtype: object

    Constructing DataFrame from numpy ndarray:

    >>> df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
    ...                    columns=['a', 'b', 'c'])
    >>> df2
       a  b  c
    0  1  2  3
    1  4  5  6
    2  7  8  9

In [44]:
l

[-5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45]

In [46]:
pd.Series(l)

0     -5
1      0
2      5
3     10
4     15
5     20
6     25
7     30
8     35
9     40
10    45
dtype: int64

In [45]:
pd.DataFrame(l)

     0
0   -5
1    0
2    5
3   10
4   15
5   20
6   25
7   30
8   35
9   40
10  45

In [47]:
pd.DataFrame(l, columns=['column 1'])

    column 1
0         -5
1          0
2          5
3         10
4         15
5         20
6         25
7         30
8         35
9         40
10        45

In [49]:
ll=[[i for i in range(j,j+5)] for j in range(0,10)]

In [50]:
ll

[[0, 1, 2, 3, 4],
 [1, 2, 3, 4, 5],
 [2, 3, 4, 5, 6],
 [3, 4, 5, 6, 7],
 [4, 5, 6, 7, 8],
 [5, 6, 7, 8, 9],
 [6, 7, 8, 9, 10],
 [7, 8, 9, 10, 11],
 [8, 9, 10, 11, 12],
 [9, 10, 11, 12, 13]]

In [51]:
pd.DataFrame(ll)

   0   1   2   3   4
0  0   1   2   3   4
1  1   2   3   4   5
2  2   3   4   5   6
3  3   4   5   6   7
4  4   5   6   7   8
5  5   6   7   8   9
6  6   7   8   9  10
7  7   8   9  10  11
8  8   9  10  11  12
9  9  10  11  12  13

In [52]:
d={'a':[0,1,2,3,4,5], 'b':[0,1,4,9,16,25], 'c':[-1,-2,-3,-4,-5,-6]}

In [53]:
d

{'a': [0, 1, 2, 3, 4, 5],
 'b': [0, 1, 4, 9, 16, 25],
 'c': [-1, -2, -3, -4, -5, -6]}

In [54]:
pd.DataFrame(d)

   a   b  c
0  0   0 -1
1  1   1 -2
2  2   4 -3
3  3   9 -4
4  4  16 -5
5  5  25 -6

In [55]:
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']


house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

display(pd.DataFrame(house_dict))

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [56]:
pd.DataFrame(house_dict).T

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [59]:
df=pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

## Attributes

In [60]:
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [61]:
df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [62]:
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [63]:
df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [64]:
df.shape #number of rows and number of columns

(10, 5)

In [65]:
df.size

50

## methods

In [67]:
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [68]:
df.tail()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [69]:
df.sample()

              LotSize Neighborhood  YearBuilt  Quality  SalePrice
Snyder House    10084      Somerst       2004        8     307000

In [70]:
df['LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [72]:
df['Quality']

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [73]:
df.Quality

Baker House        5
Beazley House      5
Dominguez House    8
Hamilton House     7
James House        7
Martinez House     6
Roberts House      7
Smith House        7
Snyder House       8
Zuckerman House    7
Name: Quality, dtype: int64

In [74]:
df[['LotSize', 'Quality']]

                 LotSize  Quality
Baker House         7420        5
Beazley House      14115        5
Dominguez House    14260        8
Hamilton House      6120        7
James House        11250        7
Martinez House      9600        6
Roberts House       9550        7
Smith House         8450        7
Snyder House       10084        8
Zuckerman House    10382        7

In [75]:
# select a row
df.loc['Beazley House']

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [76]:
df.loc[['Beazley House','Snyder House']]

               LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House    14115      Mitchel       1993        5     143000
Snyder House     10084      Somerst       2004        8     307000

In [77]:
# select specific rows and specific column
df.loc[['Beazley House','Snyder House'], 'Quality']

Beazley House    5
Snyder House     8
Name: Quality, dtype: int64

In [79]:
df.loc[['Beazley House','Snyder House'], ['LotSize','Quality']]

               LotSize  Quality
Beazley House    14115        5
Snyder House     10084        8

In [80]:
df.loc['Beazley House':'Snyder House']

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000

In [81]:
df.loc['Beazley House':'Snyder House', 'LotSize':'Quality']

                 LotSize Neighborhood  YearBuilt  Quality
Beazley House      14115      Mitchel       1993        5
Dominguez House    14260      NoRidge       2000        8
Hamilton House      6120      OldTown       1931        7
James House        11250      CollgCr       2001        7
Martinez House      9600      Veenker       1976        6
Roberts House       9550      Crawfor       1915        7
Smith House         8450      CollgCr       2003        7
Snyder House       10084      Somerst       2004        8

In [82]:
df.iloc[1]

LotSize           14115
Neighborhood    Mitchel
YearBuilt          1993
Quality               5
SalePrice        143000
Name: Beazley House, dtype: object

In [83]:
df.iloc[1:5]

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [84]:
df.iloc[:, 1:3]

                Neighborhood  YearBuilt
Baker House          BrkSide       1939
Beazley House        Mitchel       1993
Dominguez House      NoRidge       2000
Hamilton House       OldTown       1931
James House          CollgCr       2001
Martinez House       Veenker       1976
Roberts House        Crawfor       1915
Smith House          CollgCr       2003
Snyder House         Somerst       2004
Zuckerman House       NWAmes       1973